app/Controllers/Artikel.php

SELECT `artikel`.*, `kategori`.`nama_kategori`
FROM `artikel`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `artikel`.`id_kategori`
ORDER BY `artikel`.`id` DESC
---
    public function index()
    {
        $pager = \Config\Services::pager();
        $keyword = $this->request->getVar('q');


        $db = \Config\Database::connect();
        $builder = $db->table('artikel');
        $builder->select('artikel.*, kategori.nama_kategori');
        $builder->join('kategori', 'kategori.id_kategori = artikel.id_kategori', 'left');

        if ($keyword) {
            $builder->like('artikel.judul', $keyword);
        }

        $builder->orderBy('artikel.id', 'DESC');

        $data = [
            'title'   => 'Daftar Artikel',
            'artikel' => $builder->get()->getResultArray(),

SELECT *
FROM `kategori`
---
            ]);
        } else {
            $kategoriModel = new KategoriModel();
            $data['kategori'] = $kategoriModel->findAll();

SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '17'
SELECT *
FROM `kategori`
---
    public function edit($id)
    {
        helper(['form']);
        $artikel = new ArtikelModel();
        $dataLama = $artikel->find($id);

        if (!$dataLama) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        $validation = \Config\Services::validation();
        $rules = [
            'judul' => 'required',
            'isi'   => 'required',
        ];

        $file = $this->request->getFile('gambar');
        if ($file && $file->isValid() && !$file->hasMoved()) {
            $rules['gambar'] = 'uploaded[gambar]|mime_in[gambar,image/jpg,image/jpeg,image/png]|max_size[gambar,2048]';
        }

        $validation->setRules($rules);
        $kategoriModel = new KategoriModel();
        $kategori = $kategoriModel->findAll();

UPDATE `artikel` SET `judul` = 'Hari ini UAS untuk Fakultas Teknik', `isi` = 'Hari ini Sudah masuk', `gambar` = '1752172232_3168a0290853c75781be.jpg', `id_kategori` = '1'
WHERE `artikel`.`id` IN ('17')
---
                }
            }

            $artikel->update($id, [
                'judul'       => $this->request->getPost('judul'),
                'isi'         => $this->request->getPost('isi'),
                'gambar'      => $filename,
                'id_kategori' => $this->request->getPost('id_kategori')
            ]);