app/Controllers/Post.php

    public function index()
    {
        $model = new ArtikelModel();
        $data = $model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `artikel`
ORDER BY `id` DESC

    public function create()
    {
        $model = new ArtikelModel();
        $data = [
            'judul' => $this->request->getVar('judul'),
            'isi'   => $this->request->getVar('isi'),
        ];

        if ($model->insert($data)) {
---
INSERT INTO `artikel` (`judul`, `isi`) VALUES ('Hari ini hujan deras', 'Hujan seharian kayak pakai pengawet')

    public function delete($id = null)
    {
        $model = new ArtikelModel();

        if (!$model->find($id)) {
            return $this->failNotFound('Data tidak ditemukan.');
        }

        $model->delete($id);
---
SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '18'
DELETE FROM `artikel`
WHERE `id` IN ('18')